macbookpro/mbp.test1.log
test1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-3.15
Starting 1 thread

test1: (groupid=0, jobs=1): err= 0: pid=5123: Sun Aug 25 21:00:26 2019
  write: IOPS=39.5k, BW=154MiB/s (162MB/s)(10.0GiB/66330msec)
    slat (nsec): min=1000, max=7283.9k, avg=4190.62, stdev=13582.36
    clat (nsec): min=1146, max=32698k, avg=20009.26, stdev=115729.80
     lat (usec): min=6, max=32699, avg=24.20, stdev=116.58
    clat percentiles (nsec):
     |  1.00th=[   1672],  5.00th=[   2512], 10.00th=[   4448],
     | 20.00th=[  10432], 30.00th=[  10816], 40.00th=[  11584],
     | 50.00th=[  12224], 60.00th=[  13504], 70.00th=[  15424],
     | 80.00th=[  18304], 90.00th=[  24192], 95.00th=[  28544],
     | 99.00th=[  72192], 99.50th=[ 272384], 99.90th=[1433600],
     | 99.95th=[1597440], 99.99th=[4014080]
   bw (  KiB/s): min=109601, max=191619, per=99.58%, avg=157420.40, stdev=15728.67, samples=132
   iops        : min=27400, max=47904, avg=39354.82, stdev=3932.15, samples=132
  lat (usec)   : 2=2.33%, 4=6.43%, 10=9.60%, 20=65.73%, 50=14.34%
  lat (usec)   : 100=0.81%, 250=0.25%, 500=0.15%, 750=0.06%, 1000=0.05%
  lat (msec)   : 2=0.24%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=17.51%, sys=19.39%, ctx=3219332, majf=4, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=154MiB/s (162MB/s), 154MiB/s-154MiB/s (162MB/s-162MB/s), io=10.0GiB (10.7GB), run=66330-66330msec