macbookpro/mbp.test2.log
test2: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-3.15
Starting 1 thread

test2: (groupid=0, jobs=1): err= 0: pid=2819: Sun Aug 25 21:01:31 2019
  write: IOPS=40.5k, BW=158MiB/s (166MB/s)(10.0GiB/64786msec)
    slat (nsec): min=1019, max=6126.5k, avg=4098.10, stdev=12522.21
    clat (nsec): min=1072, max=37811k, avg=19585.82, stdev=111991.77
     lat (usec): min=6, max=37817, avg=23.68, stdev=112.75
    clat percentiles (nsec):
     |  1.00th=[   1624],  5.00th=[   2512], 10.00th=[   4448],
     | 20.00th=[  10304], 30.00th=[  10816], 40.00th=[  11456],
     | 50.00th=[  11968], 60.00th=[  12864], 70.00th=[  15040],
     | 80.00th=[  17536], 90.00th=[  23424], 95.00th=[  27520],
     | 99.00th=[  73216], 99.50th=[ 268288], 99.90th=[1433600],
     | 99.95th=[1581056], 99.99th=[3784704]
   bw (  KiB/s): min=115119, max=191466, per=99.57%, avg=161152.53, stdev=12787.65, samples=129
   iops        : min=28779, max=47866, avg=40287.81, stdev=3196.94, samples=129
  lat (usec)   : 2=2.50%, 4=6.27%, 10=9.39%, 20=67.30%, 50=13.10%
  lat (usec)   : 100=0.63%, 250=0.31%, 500=0.15%, 750=0.06%, 1000=0.05%
  lat (msec)   : 2=0.23%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=17.91%, sys=19.53%, ctx=3220159, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=158MiB/s (166MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=10.0GiB (10.7GB), run=64786-64786msec