macbookpro/mbp.test3.log
test3: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=1
fio-3.15
Starting 1 thread

test3: (groupid=0, jobs=1): err= 0: pid=4867: Sun Aug 25 21:02:36 2019
  write: IOPS=40.5k, BW=158MiB/s (166MB/s)(10.0GiB/64704msec)
    slat (nsec): min=1001, max=12067k, avg=4041.26, stdev=17820.52
    clat (nsec): min=1113, max=43581k, avg=19611.60, stdev=107646.01
     lat (usec): min=6, max=46453, avg=23.65, stdev=109.63
    clat percentiles (nsec):
     |  1.00th=[   1688],  5.00th=[   2576], 10.00th=[   5600],
     | 20.00th=[  10432], 30.00th=[  10816], 40.00th=[  11584],
     | 50.00th=[  12096], 60.00th=[  13248], 70.00th=[  15296],
     | 80.00th=[  17792], 90.00th=[  23680], 95.00th=[  28032],
     | 99.00th=[  69120], 99.50th=[ 252928], 99.90th=[1433600],
     | 99.95th=[1564672], 99.99th=[3522560]
   bw (  KiB/s): min=94115, max=192142, per=99.50%, avg=161245.32, stdev=16146.79, samples=129
   iops        : min=23528, max=48035, avg=40310.97, stdev=4036.70, samples=129
  lat (usec)   : 2=2.18%, 4=6.16%, 10=9.53%, 20=67.01%, 50=13.65%
  lat (usec)   : 100=0.73%, 250=0.24%, 500=0.14%, 750=0.06%, 1000=0.05%
  lat (msec)   : 2=0.23%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=17.75%, sys=19.54%, ctx=3223002, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=158MiB/s (166MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=10.0GiB (10.7GB), run=64704-64704msec