macbookpro/mbp.test4.log
test4: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=16
fio-3.15
Starting 1 thread

test4: (groupid=0, jobs=1): err= 0: pid=4355: Sun Aug 25 21:03:21 2019
  write: IOPS=58.4k, BW=228MiB/s (239MB/s)(10.0GiB/44887msec)
    slat (nsec): min=723, max=11510k, avg=8225.45, stdev=32490.02
    clat (usec): min=13, max=23993, avg=195.73, stdev=422.96
     lat (usec): min=15, max=23995, avg=203.95, stdev=423.81
    clat percentiles (usec):
     |  1.00th=[   23],  5.00th=[   37], 10.00th=[   46], 20.00th=[   63],
     | 30.00th=[   79], 40.00th=[   95], 50.00th=[  112], 60.00th=[  129],
     | 70.00th=[  147], 80.00th=[  172], 90.00th=[  235], 95.00th=[  742],
     | 99.00th=[ 1729], 99.50th=[ 1975], 99.90th=[ 5473], 99.95th=[ 7635],
     | 99.99th=[11076]
   bw (  KiB/s): min=164530, max=284135, per=99.63%, avg=232747.89, stdev=26016.00, samples=89
   iops        : min=41132, max=71033, avg=58186.62, stdev=6503.98, samples=89
  lat (usec)   : 20=0.63%, 50=11.80%, 100=30.97%, 250=47.37%, 500=3.27%
  lat (usec)   : 750=0.99%, 1000=0.69%
  lat (msec)   : 2=3.81%, 4=0.31%, 10=0.15%, 20=0.02%, 50=0.01%
  cpu          : usr=18.67%, sys=22.35%, ctx=1671690, majf=0, minf=10
  IO depths    : 1=1.1%, 2=7.8%, 4=25.6%, 8=57.0%, 16=8.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=93.5%, 8=0.4%, 16=6.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2621440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=228MiB/s (239MB/s), 228MiB/s-228MiB/s (239MB/s-239MB/s), io=10.0GiB (10.7GB), run=44887-44887msec