macbookpro/mbp.test5.log
test5: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=posixaio, iodepth=1
fio-3.15
Starting 1 thread

test5: (groupid=0, jobs=1): err= 0: pid=4355: Sun Aug 25 21:03:56 2019
  write: IOPS=2408, BW=301MiB/s (316MB/s)(10.0GiB/34011msec)
    slat (usec): min=2, max=1871, avg=10.31, stdev=28.86
    clat (usec): min=2, max=42713, avg=402.29, stdev=541.04
     lat (usec): min=257, max=42795, avg=412.60, stdev=542.37
    clat percentiles (usec):
     |  1.00th=[  243],  5.00th=[  281], 10.00th=[  289], 20.00th=[  297],
     | 30.00th=[  310], 40.00th=[  318], 50.00th=[  330], 60.00th=[  347],
     | 70.00th=[  363], 80.00th=[  383], 90.00th=[  429], 95.00th=[  537],
     | 99.00th=[ 1893], 99.50th=[ 3589], 99.90th=[ 8848], 99.95th=[ 9765],
     | 99.99th=[12256]
   bw (  KiB/s): min=227952, max=352253, per=99.52%, avg=306813.40, stdev=27953.55, samples=68
   iops        : min= 1780, max= 2751, avg=2396.57, stdev=218.39, samples=68
  lat (usec)   : 4=0.01%, 10=0.05%, 20=0.01%, 50=0.01%, 100=0.02%
  lat (usec)   : 250=0.99%, 500=93.14%, 750=2.71%, 1000=0.85%
  lat (msec)   : 2=1.28%, 4=0.50%, 10=0.39%, 20=0.04%, 50=0.01%
  cpu          : usr=2.45%, sys=2.30%, ctx=110159, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=301MiB/s (316MB/s), 301MiB/s-301MiB/s (316MB/s-316MB/s), io=10.0GiB (10.7GB), run=34011-34011msec